app/controllers/paintings_controller.rb

INSERT INTO "paintings" ("gallery_id", "name", "created_at", "updated_at", "image") VALUES (1, 'abc', '2014-01-18 10:32:09.873564', '2014-01-18 10:32:09.873564', 'untitled.txt')
---
  def create
    @painting = Painting.new(params[:painting])
    if @painting.save

SELECT "paintings".* FROM "paintings" WHERE ("paintings"."id" = 1) LIMIT 1
---
  def edit
    @painting = Painting.find(params[:id])

SELECT "paintings".* FROM "paintings" WHERE ("paintings"."id" = 2) LIMIT 1
UPDATE "paintings" SET "name" = 'jkdsajkda', "image" = '20130918_093314.jpg', "updated_at" = '2014-01-18 10:54:09.023192' WHERE ("paintings"."id" = 1)
---
  def update
    @painting = Painting.find(params[:id])
    if @painting.update_attributes(params[:painting])

SELECT "paintings".* FROM "paintings" WHERE ("paintings"."id" = 5) LIMIT 1
DELETE FROM "paintings" WHERE ("paintings"."id" = 5)
---
  def destroy
    @painting = Painting.find(params[:id])
    @painting.destroy

SELECT "paintings".* FROM "paintings" WHERE ("paintings"."id" = 6) LIMIT 1
---
  def download
    @painting = Painting.find(params[:id])